src/cf/Catalogs/Описания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Описания</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВерсииФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокОписания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСвойстваОбъектовВИсходномПорядке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОформлениеЗаголовков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбразецОформления</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыЭлементовОписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыЭлементовОписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОписаниеОбъектаФормата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заголовок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Типы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Содержание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыОбщихРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыОбщихРеквизитов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщаяТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаОбщихСвойств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлючевыеСвойства</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ЭлементыОписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ЭлементыОписания</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Описания</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовОписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПростогоОписания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьОписаниеСвойствОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводитьОписаниеГруппСвойств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОписанияРеквизитовШапки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственноеОписание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписанияРеквизитовТабличнойЧасти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТЧ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственноеОписание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписанияТипов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыФормата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПространствоИмен</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписанияПростыхТипов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОписания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Описания/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Процедура формирует документ с описанием структуры формата в HTML-формате.
// Параметры:
//   ОбщиеПеременные - Структура - Переменные, которые используются при работе.
//   АдресВременногоХранилища - Произвольный - Адрес, в который будет помещен результат выполнения процедуры.
Процедура СформироватьДокументОписанияHTML(ОбщиеПеременные, АдресВременногоХранилища) Экспорт
	СсылкаНаОписание = ОбщиеПеременные.СсылкаНаОписание;
	ЭлементОписанияОтбор = Неопределено;
	ОбщиеПеременные.Свойство("ЭлементОписанияОтбор", ЭлементОписанияОтбор);
	ОбщееОписание = Новый ФорматированныйДокумент;
	ТекстХТМЛ  = "";
	ТекстСодержание = "";
	
	// Вывод заголовка
	// Заголовок идет с уровнем 1
	ДобавитьОписаниеHTML(ТекстХТМЛ, СсылкаНаОписание.ЗаголовокОписания, , 1);
	
	ПараметрыОписания = ПараметрыОписанияВерсииФормата(СсылкаНаОписание);
	
	ВыборкаЭлементыОписания = ВыборкаЭлементовОписанияФормата(ПараметрыОписания, ЭлементОписанияОтбор);
	
	Если ВыборкаЭлементыОписания.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Описание пустое: не созданы Элементы описания'"));
		ВозвращаемоеЗначение = Новый Структура("Успешно, ТекстРезультат", Ложь, ТекстХТМЛ);
		ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
		Возврат;
	КонецЕсли;
	
	// Дополнительные параметры для передачи во вспомогательные процедуры и функции.
	СтруктураПростыеТипы = Новый Структура;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("СтруктураПростыеТипы",  СтруктураПростыеТипы);
	ДополнительныеПараметры.Вставить("СсылкаНаВерсиюФормата", ПараметрыОписания.ВерсияФормата);
	
	ПредыдущийУровеньЗаголовка = 0;
	Пока ВыборкаЭлементыОписания.СледующийПоЗначениюПоля("ЭлементСсылка") Цикл
		Если ВыборкаЭлементыОписания.ТипЭлемента = Перечисления.ТипыЭлементовОписания.Содержание Тогда
			ТекстХТМЛ = ТекстХТМЛ + Символы.ПС + "#содержание";
		ИначеЕсли ВыборкаЭлементыОписания.ТипЭлемента = Перечисления.ТипыЭлементовОписания.Типы Тогда
			ВывестиТипыФормата(ТекстХТМЛ, ВыборкаЭлементыОписания.ЭлементСсылка, ВыборкаЭлементыОписания.ТекстПростогоОписания, ДополнительныеПараметры);
		ИначеЕсли ВыборкаЭлементыОписания.ТипЭлемента <> Перечисления.ТипыЭлементовОписания.ОписаниеОбъектаФормата Тогда
			ИдентификаторГиперссылки = "";
			ТекУровеньЗаголовка = 0;
			Если ВыборкаЭлементыОписания.ТипЭлемента = Перечисления.ТипыЭлементовОписания.Заголовок Тогда
				Если ВыборкаЭлементыОписания.УровеньЗаголовка = 0 Тогда
					ТекУровеньЗаголовка = 0;
				Иначе
					ТекУровеньЗаголовка = ВыборкаЭлементыОписания.УровеньЗаголовка + 1;
				КонецЕсли;
				// Присвоим идентификатор гиперссылке
				ИдентификаторГиперссылки = СокрЛП(ВыборкаЭлементыОписания.КодЭлементаОписания);
				ДополнитьТекстСодержания(ВыборкаЭлементыОписания.ТекстПростогоОписания, ТекстСодержание, 
							ИдентификаторГиперссылки, ТекУровеньЗаголовка, ПредыдущийУровеньЗаголовка);
			КонецЕсли;
			ДобавитьОписаниеHTML(ТекстХТМЛ, ВыборкаЭлементыОписания.ТекстПростогоОписания, ИдентификаторГиперссылки, ТекУровеньЗаголовка);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаЭлементыОписания.ОбъектФормата) Тогда
			Продолжить;
		КонецЕсли;
		
		ВыводитьЗаголовокТаблицы = Истина;
		Если ВыборкаЭлементыОписания.ОбъектФорматаТипОбщегоРеквизита = Перечисления.ТипыОбщихРеквизитов.ГруппаОбщихСвойств
			Или ВыборкаЭлементыОписания.ОбъектФорматаТипОбщегоРеквизита = Перечисления.ТипыОбщихРеквизитов.КлючевыеСвойства Тогда
			// Добавим наименование объекта с гиперссылкой
			ДобавитьОписаниеHTMLИзТекстаHTML(ТекстХТМЛ, "<P><B><A name=о_" + СокрЛП(ВыборкаЭлементыОписания.ОбъектФормата)+">" + ВыборкаЭлементыОписания.ОбъектФормата + "</A></B></P>");
			ВыводитьЗаголовокТаблицы = Ложь;
		ИначеЕсли ВыборкаЭлементыОписания.ОбъектФорматаТипОбщегоРеквизита = Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть Тогда
			// Добавим наименование объекта с гиперссылкой
			ДобавитьОписаниеHTMLИзТекстаHTML(ТекстХТМЛ, "<P><B><A name=tb_" + СокрЛП(ВыборкаЭлементыОписания.ОбъектФормата)+">" + ВыборкаЭлементыОписания.ОбъектФормата + "</A></B></P>");
			ВыводитьЗаголовокТаблицы = Ложь;
		Иначе
			// Добавим наименование объекта без гиперссылки
			ДобавитьОписаниеHTMLИзТекстаHTML(ТекстХТМЛ, "<P><B>" + ВыборкаЭлементыОписания.ОбъектФормата + "</B></P>");
		КонецЕсли;
		ДобавитьОписаниеHTML(ТекстХТМЛ, ВыборкаЭлементыОписания.ТекстПростогоОписания);
		// Создадим таблицы значений
		ТЗШапка = СоздатьТаблицуЗначенийДляШапки();
		ТЗСписокТЧ = СоздатьТаблицуЗначенийДляСпискаТЧ();
		СтруктураТаблицТЧ = Новый Структура;
		Пока ВыборкаЭлементыОписания.Следующий() Цикл
			Если СокрЛП(ВыборкаЭлементыОписания.СвойствоФорматаНаименование) = "AdditionalInfo" Тогда
				Продолжить;
			КонецЕсли;    
			ОписаниеСтрокой = ПолучитьОписаниеСвойстваФорматаСтрокой(ОбщиеПеременные.СсылкаНаОписание, ВыборкаЭлементыОписания.СвойствоФорматаОбъектХранительСвойств,
				ВыборкаЭлементыОписания.СвойствоФорматаРодительОбъектХранительСвойств,
				ВыборкаЭлементыОписания.СвойствоФорматаОписание);
			УровеньСвойства = ВыборкаЭлементыОписания.СвойствоФормата.Уровень();
			
			Если ВыборкаЭлементыОписания.СвойствоФорматаЭтоГруппа
				И (ВыборкаЭлементыОписания.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть
					Или ВыборкаЭлементыОписания.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ПустаяСсылка()) Тогда
				// Табличная часть
				НовСтрока = ТЗСписокТЧ.Добавить();
				НовСтрока.Свойства = ВыборкаЭлементыОписания.СвойствоФорматаНаименование;
				НовСтрока.ТипЗначения = ВыборкаЭлементыОписания.СвойствоФорматаТип; 
				Если ВыборкаЭлементыОписания.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть Тогда
					НовСтрока.Пояснение = "См. описание " + СокрЛП(ВыборкаЭлементыОписания.СвойствоФорматаТип);
				Иначе
					Если ЗначениеЗаполнено(ОписаниеСтрокой) Тогда
						НовСтрока.Пояснение = ОписаниеСтрокой;
					КонецЕсли;
				КонецЕсли;
				НовСтрока.служебная_КодТипа = ПолучитьКодТипа(ВыборкаЭлементыОписания.СвойствоФорматаТип, ДополнительныеПараметры, Истина);  
				НовСтрока.служебная_ЭтоЭлементКлючевогоСвойства = Ложь;
			ИначеЕсли (Не ЗначениеЗаполнено(ВыборкаЭлементыОписания.СвойствоФорматаРодитель)
					Или ВыборкаЭлементыОписания.ТипОбщегоСвойстваРодитель = Перечисления.ТипыОбщихРеквизитов.ГруппаОбщихСвойств
					Или ВыборкаЭлементыОписания.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.КлючевыеСвойства)
					И УровеньСвойства <= 1 Тогда
				// Шапка
				ЭтоКС = Ложь;
				Если ВыборкаЭлементыОписания.СвойствоФорматаНаименование = "КлючевыеСвойства" Тогда
					// Ключевые свойства - ставим первыми
					НовСтрока = ТЗШапка.Вставить(0);
					ЭтоКС = Истина;
				Иначе
					НовСтрока = ТЗШапка.Добавить();
				КонецЕсли;
				НовСтрока.Свойства = ВыборкаЭлементыОписания.СвойствоФорматаНаименование;
				ДобавитьСведенияОСвойстве(НовСтрока, ВыборкаЭлементыОписания.СвойствоФормата, ДополнительныеПараметры);
				Если ЭтоКС Тогда
					Если СтрНайти(ВыборкаЭлементыОписания.ОбъектФормата, "Документ.") > 0 Тогда
						НовСтрока.Пояснение = "Поля, которые используются для автоматического сопоставления документа при загрузке, в том числе уникальная ссылка";
					Иначе
						НовСтрока.Пояснение = "Поля, которые используются для автоматического сопоставления элементов справочника при загрузке, в том числе уникальная ссылка";
					КонецЕсли;
				ИначеЕсли ВыборкаЭлементыОписания.СвойствоФорматаТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ПустаяСсылка() Тогда
					НовСтрока.Пояснение = ОписаниеСтрокой;
				Иначе
					НовСтрока.Пояснение = "См. описание " + СокрЛП(ВыборкаЭлементыОписания.СвойствоФорматаТип);
				КонецЕсли;
				НовСтрока.служебная_ЭтоКлючевоеСвойство = Ложь;
				НовСтрока.служебная_ЭтоЭлементКлючевогоСвойства = Ложь;
			Иначе
				// Реквизит табличной части
				ИмяТЧ = "";
				Если ВыборкаЭлементыОписания.ТипОбщегоСвойстваРодитель = Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть
					Или ВыборкаЭлементыОписания.ТипОбщегоСвойстваРодитель = Перечисления.ТипыОбщихРеквизитов.ПустаяСсылка() Тогда
					ИмяТЧ = СокрЛП(ВыборкаЭлементыОписания.СвойствоФорматаРодительНаименование);
				ИначеЕсли УровеньСвойства > 1 Тогда
					// Группа = ТЧ находится выше по иерархии
					УровеньВложенности = УровеньСвойства - 2;
					ТекРодитель = ВыборкаЭлементыОписания.СвойствоФорматаРодительРодитель;
					Пока УровеньВложенности >= 0 Цикл
						Если ТекРодитель.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть
							ИЛИ ТекРодитель.ТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ПустаяСсылка() Тогда
							ИмяТЧ = СокрЛП(ТекРодитель.Наименование);
							Прервать;
						КонецЕсли;
						ТекРодитель = ТекРодитель.Родитель;
						УровеньВложенности = УровеньВложенности - 1;
					КонецЦикла;
				КонецЕсли;
				Если ИмяТЧ = "" Тогда
					Продолжить;
				КонецЕсли;
				ТабТЧ = Неопределено;
				СтруктураТаблицТЧ.Свойство(ИмяТЧ, ТабТЧ);
				Если ТабТЧ = Неопределено Тогда
					ТабТЧ = СоздатьТаблицуЗначенийДляРеквизитовТЧ();
				КонецЕсли;
				НовСтрока = ТабТЧ.Добавить();
				НовСтрока.Свойства = ВыборкаЭлементыОписания.СвойствоФорматаНаименование;
				ДобавитьСведенияОСвойстве(НовСтрока, ВыборкаЭлементыОписания.СвойствоФормата, ДополнительныеПараметры);
				Если ВыборкаЭлементыОписания.СвойствоФорматаТипОбщегоСвойства = Перечисления.ТипыОбщихРеквизитов.ПустаяСсылка() Тогда
					НовСтрока.Пояснение = ОписаниеСтрокой;
				Иначе
					НовСтрока.Пояснение = "См. описание " + СокрЛП(ВыборкаЭлементыОписания.СвойствоФорматаТип);
				КонецЕсли;
				НовСтрока.служебная_ЭтоКлючевоеСвойство = Ложь;
				НовСтрока.служебная_ЭтоЭлементКлючевогоСвойства = Ложь;
				СтруктураТаблицТЧ.Вставить(ИмяТЧ, ТабТЧ);
			КонецЕсли;
		КонецЦикла; //Пока Выборка.СледующийПоЗначениюПоля("СвойствоФормата") Цикл
		Если ТЗШапка.Количество() > 0 Тогда
			ТекстХТМЛТаб = ПреобразоватьТаблицуВHTML(ТЗШапка, НСтр("ru='Шапка'"), Истина, "ТипЗначения", 4,,ВыводитьЗаголовокТаблицы И ТЗСписокТЧ.Количество()=0);
			ДобавитьОписаниеHTMLИзТекстаHTML(ТекстХТМЛ, ТекстХТМЛТаб);
		КонецЕсли;
		Если ТЗСписокТЧ.Количество() > 0 Тогда
			ТекстХТМЛТаб = ПреобразоватьТаблицуВHTML(ТЗСписокТЧ, НСтр("ru='Табличные части'"), Истина, "ТипЗначения", 3,);
			ДобавитьОписаниеHTMLИзТекстаHTML(ТекстХТМЛ, ТекстХТМЛТаб);
			Для Каждого СтрокаСпискаТЧ Из ТЗСписокТЧ Цикл
				ТабТЧ = Неопределено;
				СтруктураТаблицТЧ.Свойство(СокрЛП(СтрокаСпискаТЧ.Свойства), ТабТЧ);
				Если ТабТЧ = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ИмяЗаголовка = НСтр("ru='Табличная часть'") + ": " + СокрЛП(СтрокаСпискаТЧ.Свойства);
				ДобавитьОписаниеHTMLИзТекстаHTML(ТекстХТМЛ, "<P><B><A name=""" + СтрокаСпискаТЧ.служебная_КодТипа + """>" + ИмяЗаголовка + "</A></B></P>");
				Если ЗначениеЗаполнено(СтрокаСпискаТЧ.Пояснение) Тогда
					ДобавитьОписаниеHTMLИзТекстаHTML(ТекстХТМЛ, "<P>" + СтрокаСпискаТЧ.Пояснение + "</P>");
				КонецЕсли;
				ТекстХТМЛТаб = ПреобразоватьТаблицуВHTML(ТабТЧ, ИмяЗаголовка, Истина, "ТипЗначения", 4,,Ложь);
				ДобавитьОписаниеHTMLИзТекстаHTML(ТекстХТМЛ, ТекстХТМЛТаб);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	// Добавим содержание в текст - место найдем по специальным символам.
	Если ТекстСодержание <> "" Тогда
		ТекстСодержание = "<UL class=TOC>" + ТекстСодержание + "</UL>" ;
		ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "#содержание", ТекстСодержание); 
	КонецЕсли; 
	// Затираем возможные старые служебные теги.
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, НРег("#КлючевыеСвойства"), "");
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, НРег("#ТипыФормата"), "");
	// Вставляем получившийся текст в обрамление стиля
	ТекстСтиля = ПолучитьМакет("МакетСтильОписания").ПолучитьТекст();
	// Формируем заголовок
	ХранилищеЗаголовокОписания = СсылкаНаОписание.ЗаголовокОписания.Получить();
	Если ХранилищеЗаголовокОписания <> Неопределено Тогда
		ТекстЗаголовокОписания = ХранилищеЗаголовокОписания.ПолучитьТекст();
		ТекстСтиля = СтрЗаменить(ТекстСтиля, "</TITLE>", ""+ТекстЗаголовокОписания + "</TITLE>");
	КонецЕсли;
	ТекстХТМЛ = СтрЗаменить(ТекстСтиля, "</BODY>", ТекстХТМЛ + "</BODY>");
	Если АдресВременногоХранилища <> Неопределено Тогда
		ВозвращаемоеЗначение = Новый Структура("Успешно, ТекстРезультат", Истина, ТекстХТМЛ);
		ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, АдресВременногоХранилища);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Функция ПараметрыОписанияВерсииФормата(СсылкаОписание)
	Результат = Новый Структура;
	Результат.Вставить("Ссылка");
	Результат.Вставить("Наименование");
	Результат.Вставить("НомерВерсииФормата");
	Результат.Вставить("ЗаголовокОписания");
	Результат.Вставить("ВыводитьСвойстваОбъектовВИсходномПорядке");
	Результат.Вставить("ВерсияФормата");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Описания.Ссылка КАК Ссылка,
	|	Описания.Наименование КАК Наименование,
	|	Описания.НомерВерсииФормата КАК НомерВерсииФормата,
	|	Описания.ЗаголовокОписания КАК ЗаголовокОписания,
	|	Описания.ВыводитьСвойстваОбъектовВИсходномПорядке КАК ВыводитьСвойстваОбъектовВИсходномПорядке,
	|	ВерсииФормата.Ссылка КАК ВерсияФормата
	|ИЗ
	|	Справочник.Описания КАК Описания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВерсииФормата КАК ВерсииФормата
	|		ПО Описания.НомерВерсииФормата = ВерсииФормата.Наименование
	|ГДЕ
	|	Описания.Ссылка = &СсылкаОписание");
	Запрос.УстановитьПараметр("СсылкаОписание", СсылкаОписание);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ВыборкаЭлементовОписанияФормата(ПараметрыОписания, ЭлементОписанияОтбор)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЭлементыОписания.Ссылка КАК ЭлементСсылка,
	|	ЭлементыОписания.Код КАК КодЭлементаОписания,
	|	ЭлементыОписания.ТекстПростогоОписания КАК ТекстПростогоОписания,
	|	ЭлементыОписания.Порядок КАК Порядок,
	|	ЕСТЬNULL(ЭлементыОписания.УровеньЗаголовка, 0) КАК УровеньЗаголовка,
	|	ЭлементыОписания.ТипЭлемента КАК ТипЭлемента,
	|	ОбъектыФормата.Ссылка КАК ОбъектФормата,
	|	ОбъектыФормата.ТипОбщегоРеквизита КАК ОбъектФорматаТипОбщегоРеквизита,
	|	СвойстваФормата.Ссылка КАК СвойствоФормата,
	|	СвойстваФормата.Тип КАК СвойствоФорматаТип,  
	|	СвойстваФормата.ТипОбщегоСвойства КАК СвойствоФорматаТипОбщегоСвойства, 
	|	СвойстваФормата.ОбъектХранительСвойств КАК СвойствоФорматаОбъектХранительСвойств, 
	|	ЕСТЬNULL(СвойстваФормата.Родитель.ОбъектХранительСвойств, """") КАК СвойствоФорматаРодительОбъектХранительСвойств,
	|	СвойстваФормата.Наименование КАК СвойствоФорматаНаименование,
	|	СвойстваФормата.ЭтоГруппа КАК СвойствоФорматаЭтоГруппа,
	|	СвойстваФормата.Родитель КАК СвойствоФорматаРодитель,
	|	ВЫБОР КОГДА ТЧОписанияРеквизитовШапки.Ссылка is not null ТОГДА
	|		ТЧОписанияРеквизитовШапки.ТекстОписания
	|	КОГДА ОписанияРеквизитовТЧ.Ссылка is not null ТОГДА
	|		ОписанияРеквизитовТЧ.ТекстОписания
	|	ИНАЧЕ """" КОНЕЦ КАК СвойствоФорматаОписание,
	|	ЕСТЬNULL(СвойстваФормата.Родитель.Родитель, ЗНАЧЕНИЕ(Справочник.СвойстваФормата.ПустаяСсылка)) КАК СвойствоФорматаРодительРодитель,
	|	ЕСТЬNULL(СвойстваФормата.Родитель.Наименование, """") КАК СвойствоФорматаРодительНаименование,
	|	СвойстваФормата.Родитель.ТипОбщегоСвойства КАК ТипОбщегоСвойстваРодитель,
	|	СвойстваФормата.ТипОбщегоСвойства КАК ТипОбщегоСвойства
	|ИЗ
	|	Справочник.ЭлементыОписания КАК ЭлементыОписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|		ПО ЭлементыОписания.ОбъектФормата = ОбъектыФормата.Наименование
	|			И (ЭлементыОписания.ТипЭлемента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовОписания.ОписаниеОбъектаФормата))
	|			И (ОбъектыФормата.Владелец = &ВерсияФормата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СвойстваФормата КАК СвойстваФормата
	|		ПО (СвойстваФормата.Владелец = ОбъектыФормата.Ссылка)
	|			И (
	|					(СвойстваФормата.ЭтоГруппа = ЛОЖЬ
	|					И 
	|						(СвойстваФормата.Родитель = ЗНАЧЕНИЕ(Справочник.СвойстваФормата.ПустаяСсылка)
	|						ИЛИ ЕСТЬNULL(СвойстваФормата.Родитель.ТипОбщегоСвойства,ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ПустаяСсылка)))
	|				ИЛИ (СвойстваФормата.ЭтоГруппа = ИСТИНА
	|					И ЕСТЬNULL(СвойстваФормата.Родитель.ТипОбщегоСвойства,ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.ПустаяСсылка))
	|				)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыОписания.ОписанияРеквизитовШапки КАК ТЧОписанияРеквизитовШапки
	|		ПО ТЧОписанияРеквизитовШапки.Ссылка = ЭлементыОписания.Ссылка И ТЧОписанияРеквизитовШапки.СобственноеОписание = ИСТИНА
	|			И ТЧОписанияРеквизитовШапки.ЭтоГруппа = СвойстваФормата.ЭтоГруппа
	|			И ТЧОписанияРеквизитовШапки.Наименование = СвойстваФормата.Наименование
	|			И СвойстваФормата.Родитель = ЗНАЧЕНИЕ(Справочник.СвойстваФормата.ПустаяСсылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыОписания.ОписанияРеквизитовТабличнойЧасти КАК ОписанияРеквизитовТЧ
	|		ПО ОписанияРеквизитовТЧ.Ссылка = ЭлементыОписания.Ссылка И ОписанияРеквизитовТЧ.СобственноеОписание = ИСТИНА
	|			И СвойстваФормата.ЭтоГруппа = ЛОЖЬ
	|			И ОписанияРеквизитовТЧ.Наименование = СвойстваФормата.Наименование 
	|			И ОписанияРеквизитовТЧ.НаименованиеТЧ = СвойстваФормата.Родитель.Наименование
	|			И СвойстваФормата.Родитель <> ЗНАЧЕНИЕ(Справочник.СвойстваФормата.ПустаяСсылка)
	|ГДЕ
	|	ЭлементыОписания.Владелец = &СсылкаНаОписание
	|	И НЕ ЭлементыОписания.ПометкаУдаления
	|	И ЕСТЬNULL(ОбъектыФормата.ПометкаУдаления, ЛОЖЬ) = ЛОЖЬ
	|	И ЕСТЬNULL(СвойстваФормата.ПометкаУдаления, ЛОЖЬ) = ЛОЖЬ");
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	ЭлементыОписания.Ссылка.Порядок ИЕРАРХИЯ,
	|	ЭлементыОписания.Порядок ВОЗР,
	|	ЭлементыОписания.Наименование ВОЗР,
	|" + ?(ПараметрыОписания.ВыводитьСвойстваОбъектовВИсходномПорядке,
		"	СвойстваФормата.Порядок ВОЗР,
		|	СвойстваФормата.Ссылка ИЕРАРХИЯ",
		"	СвойстваФормата.Наименование ВОЗР,
		|	СвойстваФормата.Ссылка ИЕРАРХИЯ");
	
	Запрос.УстановитьПараметр("СсылкаНаОписание", ПараметрыОписания.Ссылка);
	Запрос.УстановитьПараметр("ВерсияФормата",    ПараметрыОписания.ВерсияФормата);
	Если ЭлементОписанияОтбор <> Неопределено Тогда
		Запрос.УстановитьПараметр("ЭлементОписанияОтбор", ЭлементОписанияОтбор);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&СсылкаНаОписание" , "&СсылкаНаОписание И ЭлементыОписания.Ссылка В ИЕРАРХИИ (&ЭлементОписанияОтбор)");
	КонецЕсли;

	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ДобавитьОписаниеHTML(ТекстОписания, ХранилищеСОписанием, ИдентификаторГиперссылки = "", УровеньЗаголовка = 0)
	КусокОписания = ХранилищеСОписанием.Получить();
	Если КусокОписания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	КусокHTML = КусокОписания.ПолучитьТекст();
	
	Если ИдентификаторГиперссылки <> "" Тогда
		// Надо дополнить текст идентификатором для гиперссылки
		НачалоГиперссылки = "<A name=" + ИдентификаторГиперссылки + ">";
		КусокHTML = НачалоГиперссылки + КусокHTML + "</A>";
	КонецЕсли;
	Если УровеньЗаголовка > 0 Тогда
		КусокHTML = "<H"+УровеньЗаголовка+">" + КусокHTML + "</H"+УровеньЗаголовка+">";
	Иначе
		КусокHTML = "<P>" + КусокHTML + "</P>";
	КонецЕсли;
	
	Если ТекстОписания = "" Тогда
		ТекстОписания = КусокHTML;
	Иначе
		ТекстОписания = ТекстОписания + Символы.ПС + КусокHTML;
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьОписаниеHTMLИзТекстаHTML(ТекстОписания, ТекстHTML)
	ТекстОписания = ТекстОписания + Символы.ПС + ТекстHTML;
КонецПроцедуры

Процедура ДополнитьТекстСодержания(ХранилищеСОписанием, ТекстСодержания, ИдентификаторГиперссылки, УровеньЗаголовка, ПредыдущийУровеньЗаголовка)
	КусокОписания = ХранилищеСОписанием.Получить();
	Если КусокОписания = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстЗаголовка = КусокОписания.ПолучитьТекст();
	Если НЕ ЗначениеЗаполнено(ТекстЗаголовка) Тогда
		Возврат;
	КонецЕсли;
	ДополнениеКСодержанию = "";
	ДополнениеКСодержаниюЛокально = "";
	КоличествоИтераций = 0;
	Если ПредыдущийУровеньЗаголовка <> 0 Тогда
		Если ПредыдущийУровеньЗаголовка > УровеньЗаголовка Тогда
			ДополнениеКСодержаниюЛокально = "</LI></UL>";
			КоличествоИтераций = ПредыдущийУровеньЗаголовка - УровеньЗаголовка;
		ИначеЕсли ПредыдущийУровеньЗаголовка < УровеньЗаголовка Тогда
			ДополнениеКСодержаниюЛокально = "<UL class=TOC>";
			КоличествоИтераций = УровеньЗаголовка - ПредыдущийУровеньЗаголовка;
		КонецЕсли;
		Если КоличествоИтераций > 0 Тогда
			Для Итерация = 1 По КоличествоИтераций Цикл
				ДополнениеКСодержанию = ДополнениеКСодержанию + ДополнениеКСодержаниюЛокально;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	ПредыдущийУровеньЗаголовка = УровеньЗаголовка;
	ДополнениеКСодержанию = ДополнениеКСодержанию + "<LI><A href=""#" 
							+ ИдентификаторГиперссылки + """>" + ТекстЗаголовка + "</A>";
	ТекстСодержания = ТекстСодержания + ДополнениеКСодержанию + Символы.ПС;
КонецПроцедуры

Функция ПолучитьКодТипа(Знач ИмяТипа, ДополнительныеПараметры, ЭтоТЧ = Ложь)
	СсылкаНаТип_ОФ = Справочники.ОбъектыФормата.НайтиПоНаименованию(ИмяТипа,,,ДополнительныеПараметры.СсылкаНаВерсиюФормата);
	Если ЗначениеЗаполнено(СсылкаНаТип_ОФ) Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаТип_ОФ, "ТипОбщегоРеквизита") = Перечисления.ТипыОбщихРеквизитов.ГруппаОбщихСвойств
			Или ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаТип_ОФ, "ТипОбщегоРеквизита") = Перечисления.ТипыОбщихРеквизитов.КлючевыеСвойства Тогда
			Возврат "о_" + СокрЛП(ИмяТипа);
		ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаТип_ОФ, "ТипОбщегоРеквизита") = Перечисления.ТипыОбщихРеквизитов.ОбщаяТабличнаяЧасть Тогда
			Возврат "tb_" + СокрЛП(ИмяТипа);
		КонецЕсли;
	КонецЕсли;
	СсылкаНаТип = Справочники.ТипыФормата.НайтиПоНаименованию(ИмяТипа,,,ДополнительныеПараметры.СсылкаНаВерсиюФормата);
	Если ЗначениеЗаполнено(СсылкаНаТип) Тогда
		Возврат "т_"+СсылкаНаТип.Код;
	ИначеЕсли ЭтоТЧ Тогда
		// частная таб часть
		Возврат "tb_" + СтрЗаменить(ИмяТипа, ".", "_");
	Иначе
		Если Найти(ИмяТипа, ".") = 0 И Найти(ИмяТипа, ";") = 0 Тогда
			ПозицияКонца = Найти(ИмяТипа, "(");
			Если ПозицияКонца > 0 Тогда
				ИмяТипа = СокрЛП(Лев(ИмяТипа, ПозицияКонца-1));
			КонецЕсли;
			// Простой тип
			Если НЕ ДополнительныеПараметры.СтруктураПростыеТипы.Свойство(ИмяТипа) Тогда
				ДополнительныеПараметры.СтруктураПростыеТипы.Вставить(ИмяТипа, "т_"+ИмяТипа);
			КонецЕсли;
			Возврат "т_"+ИмяТипа;
		КонецЕсли;
	КонецЕсли;
	Возврат "";
КонецФункции

Процедура ВывестиТипыФормата(ТекстХТМЛ, ЭлементОписанияСсылка, ТекстОписанияВШапке, ДополнительныеПараметры)
	ДобавитьОписаниеHTML(ТекстХТМЛ, ТекстОписанияВШапке, "", 0);
	Если ЭлементОписанияСсылка.ОписанияПростыхТипов.Количество() > 0 Тогда
		// Выведем простые типы
		СамыйБазовыйПИ = "";
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПространствоИменБазовогоТипа КАК ПИ
		|ИЗ Справочник.ТипыФормата
		|ГДЕ БазовыйТип ПОДОБНО &БазовыйТип";
		Запрос.УстановитьПараметр("БазовыйТип", "string");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СамыйБазовыйПИ = Выборка.ПИ;
		КонецЕсли;
		
		ТЗ1 = Новый ТаблицаЗначений;
		ТЗ1.Колонки.Добавить("ИмяТипа",,НСтр("ru='Имя типа'"));
		ТЗ1.Колонки.Добавить("служебная_КодТипа");
		ТЗ1.Колонки.Добавить("Пояснение",,НСтр("ru='Пояснение'")); 
		Для Каждого СтрокаТЧ Из ЭлементОписанияСсылка.ОписанияПростыхТипов Цикл
			СтрокаТЗ = ТЗ1.Добавить();
			СтрокаТЗ.ИмяТипа = СтрокаТЧ.Наименование;
			СтрокаТЗ.служебная_КодТипа = "т_" + СокрЛП(СтрокаТЧ.Наименование);
			СтрокаТЗ.Пояснение = СокрЛП(СтрокаТЧ.ТекстОписания);
		КонецЦикла;
		ТекстХТМЛТаб = ПреобразоватьТаблицуВHTML(ТЗ1, СамыйБазовыйПИ, Ложь, "ИмяТипа", 1, 1);
		ТекстХТМЛ = ТекстХТМЛ + ТекстХТМЛТаб;
	КонецЕсли;
	Если ЭлементОписанияСсылка.ОписанияТипов.Количество() > 0 Тогда
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("ИмяТипа",,НСтр("ru='Имя типа'"));
		ТЗ.Колонки.Добавить("служебная_КодТипа");
		ТЗ.Колонки.Добавить("БазовыйТип",,НСтр("ru='Базовый тип'"));
		ТЗ.Колонки.Добавить("Пояснение",,НСтр("ru='Пояснение'")); 
		ПространствоИмен = "";
		Для Каждого СтрокаТЧ Из ЭлементОписанияСсылка.ОписанияТипов Цикл
			ДанныеТипа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.Тип, "Код, Наименование");
			СтрокаТЗ = ТЗ.Добавить();
			СтрокаТЗ.ИмяТипа = ДанныеТипа.Наименование;
			СтрокаТЗ.БазовыйТип = СтрокаТЧ.БазовыйТип;
			СтрокаТЗ.Пояснение = СтрокаТЧ.ТекстОписания;
			СтрокаТЗ.служебная_КодТипа = "т_"+ДанныеТипа.Код;
			ПространствоИмен = СтрокаТЧ.ПространствоИмен;
		КонецЦикла;
		ТекстХТМЛТаб = ПреобразоватьТаблицуВHTML(ТЗ, ПространствоИмен, Ложь, "ИмяТипа", 1, 1);
		ТекстХТМЛ = ТекстХТМЛ + ТекстХТМЛТаб;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьОписаниеСвойстваФорматаСтрокой(СсылкаНаОписание, ОбъектХранительСвойств, РодительОбъектХранительСвойств, Описание)
	Если ЗначениеЗаполнено(Описание) Тогда
		Возврат Описание;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ОбъектХранительСвойств) И Не ЗначениеЗаполнено(РодительОбъектХранительСвойств) Тогда
		Возврат "";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТекстПростогоОписания КАК Описание
		|ИЗ Справочник.ЭлементыОписания КАК ЭлементыОписанияШ
		|ГДЕ ЭлементыОписанияШ.Владелец = &СсылкаНаОписание
		|	И ЭлементыОписанияШ.ТипЭлемента = ЗНАЧЕНИЕ(Перечисление.ТипыЭлементовОписания.ОписаниеОбъектаФормата)
		|	И ЭлементыОписанияШ.ОбъектФормата = &ОбъектФормата";
	Если ЗначениеЗаполнено(ОбъектХранительСвойств) Тогда
		Запрос.УстановитьПараметр("ОбъектФормата", ОбъектХранительСвойств);
	Иначе
		Запрос.УстановитьПараметр("ОбъектФормата", РодительОбъектХранительСвойств);
	КонецЕсли;
	Запрос.УстановитьПараметр("СсылкаНаОписание", СсылкаНаОписание);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ХранилищеОписания = Выборка.Описание.Получить();
		Если ХранилищеОписания <> Неопределено Тогда
			Возврат ХранилищеОписания.ПолучитьТекст();
		КонецЕсли;
	КонецЕсли;
	Возврат "";
КонецФункции

// Возвращает текст в формате HTML
Функция ПреобразоватьТаблицуВHTML(ТаблицаИсходная, ЗаголовокТаблицы, ПроверятьКлючевыеПоля, ИмяКолонкиСГиперссылкой = "", ИндексКолонкиЗначениеГиперссылки = 0, ТипГиперссылки = 0, ВыводитьЗаголовокТаблицы = Истина)
	ТекстТаблицы = "<TABLE id=table3 class=withBorder cellSpacing=0 cellPadding=3 width=800 border=0>" + Символы.ПС;
	Если ВыводитьЗаголовокТаблицы Тогда
		ТекстТаблицы = ТекстТаблицы + "<thead><b> "+СокрЛП(ЗаголовокТаблицы)+" </b></thead> " + Символы.ПС;
	КонецЕсли;
	// Заголовок
	ТекстТаблицы = ТекстТаблицы + "<tr BGCOLOR=lightgrey>";
	Для Каждого КолонкаТЗ Из ТаблицаИсходная.Колонки Цикл
		ЗаголовокКолонки = СокрЛП(КолонкаТЗ.Заголовок);
		// Служебная колонка - не отображается
		Если СтрДлина(КолонкаТЗ.Имя) > 10 И Лев(КолонкаТЗ.Имя, 10) = "служебная_" Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЗаголовокКолонки) Тогда
			ЗаголовокКолонки = СокрЛП(КолонкаТЗ.Имя);
		КонецЕсли;
		
		ТекстТаблицы = ТекстТаблицы + "<td> " + ЗаголовокКолонки + "</td>";
	КонецЦикла;
	ТекстТаблицы = ТекстТаблицы + "</tr>" + Символы.ПС;
	// Строки
	КоличествоКолонок = ТаблицаИсходная.Колонки.Количество();
	Для Каждого СтрокаТЗ Из ТаблицаИсходная Цикл
		ТекстТаблицы = ТекстТаблицы + "<tr >" + Символы.ПС + Символы.Таб;
		ИдентификаторГиперссылки = "";
		Если ИндексКолонкиЗначениеГиперссылки > 0 Тогда
			ИдентификаторГиперссылки = СтрокаТЗ[ИндексКолонкиЗначениеГиперссылки];
		КонецЕсли;
		ОбрамлениеНачало = "<td align=left>";
		ОбрамлениеОкончание = "</td>";

		Для НомерКолонки = 0 По КоличествоКолонок-1 Цикл
			ИмяКолонки = ТаблицаИсходная.Колонки[НомерКолонки].Имя;
			// Служебная колонка - не отображается
			Если СтрДлина(ИмяКолонки) > 10 И Лев(ИмяКолонки, 10) = "служебная_" Тогда
				Продолжить;
			КонецЕсли;

			ЗначениеЯчейки = СокрЛП(СтрокаТЗ[НомерКолонки]); 
			Если НЕ ЗначениеЗаполнено(ЗначениеЯчейки) Тогда
				ЗначениеЯчейки = "&nbsp;";
			КонецЕсли;
			Если НомерКолонки = 0 Тогда
				Отступ = "";
				Если ПроверятьКлючевыеПоля И СтрокаТЗ.служебная_ЭтоЭлементКлючевогоСвойства Тогда
					Для Уровень = 1 По СтрокаТЗ.служебная_УровеньКлючевогоСвойства Цикл
						Отступ = Отступ + "&nbsp;&nbsp;&nbsp;&nbsp;";
					КонецЦикла;
				КонецЕсли;
				ЗначениеЯчейки = "" + Отступ + ЗначениеЯчейки + "";
			КонецЕсли;
			
			Если ИдентификаторГиперссылки <> "" И ИмяКолонки = ИмяКолонкиСГиперссылкой Тогда
				// Особый случай - составной текст из нескольких гиперссылок
				Если ТипЗнч(ИдентификаторГиперссылки) = Тип("Структура") Тогда
					ТекстВЯчейку = "";
					Для Каждого КлючИЗначение Из ИдентификаторГиперссылки Цикл
						ТекстВЯчейку = ТекстВЯчейку + "<A href=""#" + КлючИЗначение.Ключ + """>" + КлючИЗначение.Значение + "</A><BR>" + Символы.ПС;
					КонецЦикла;
					ТекстТаблицы = ТекстТаблицы + ОбрамлениеНачало + ТекстВЯчейку + ОбрамлениеОкончание;
					Продолжить;
				КонецЕсли;
				
				Если ТипГиперссылки = 0 Тогда
					// вставляем саму гиперссылку 
					НачалоГиперссылки = "<A href=""#" + ИдентификаторГиперссылки + """>";
				Иначе
					// вставляем закладку для гиперссылки
					НачалоГиперссылки = "<A name=""" + ИдентификаторГиперссылки + """>";
				КонецЕсли;
				
				ТекстТаблицы = ТекстТаблицы + ОбрамлениеНачало + НачалоГиперссылки + ЗначениеЯчейки + "</A>" + ОбрамлениеОкончание;
			Иначе
				ТекстТаблицы = ТекстТаблицы + ОбрамлениеНачало + ЗначениеЯчейки + ОбрамлениеОкончание;
			КонецЕсли;
		КонецЦикла;
		ТекстТаблицы = ТекстТаблицы + "</tr>" + Символы.ПС;
	КонецЦикла;
	// Дописываем хвост
	ТекстТаблицы = ТекстТаблицы + "</table><BR>" + Символы.ПС;
	Возврат ТекстТаблицы;
КонецФункции

Функция СоздатьТаблицуЗначенийДляШапки()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Свойства",,НСтр("ru='Свойства'"));
	ТЗ.Колонки.Добавить("ТипЗначения",,НСтр("ru='Тип значения'"));
	ТЗ.Колонки.Добавить("Обязательный",,НСтр("ru='Обязательный'"));
	ТЗ.Колонки.Добавить("Пояснение",,НСтр("ru='Пояснение'"));
	ТЗ.Колонки.Добавить("служебная_КодТипа");
	ТЗ.Колонки.Добавить("служебная_ЭтоКлючевоеСвойство");
	ТЗ.Колонки.Добавить("служебная_ЭтоЭлементКлючевогоСвойства");
	ТЗ.Колонки.Добавить("служебная_УровеньКлючевогоСвойства");
	ТЗ.Колонки.Добавить("служебная_СоставнойТип", Новый ОписаниеТипов("Булево"));
	ТЗ.Колонки.Добавить("служебная_СоставТипа");
	Возврат ТЗ;
КонецФункции

Функция СоздатьТаблицуЗначенийДляСпискаТЧ()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Свойства",,НСтр("ru='Свойства'"));
	ТЗ.Колонки.Добавить("ТипЗначения",,НСтр("ru='Тип значения'"));
	ТЗ.Колонки.Добавить("Пояснение",,НСтр("ru='Пояснение'"));
	ТЗ.Колонки.Добавить("служебная_КодТипа");
	ТЗ.Колонки.Добавить("служебная_ЭтоЭлементКлючевогоСвойства");
	Возврат ТЗ;
КонецФункции

Функция СоздатьТаблицуЗначенийДляРеквизитовТЧ()
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Свойства",,НСтр("ru='Свойства'"));
	ТЗ.Колонки.Добавить("ТипЗначения",,НСтр("ru='Тип значения'"));
	ТЗ.Колонки.Добавить("Обязательный",,НСтр("ru='Обязательный'"));
	ТЗ.Колонки.Добавить("Пояснение",,НСтр("ru='Пояснение'"));
	ТЗ.Колонки.Добавить("служебная_КодТипа");
	ТЗ.Колонки.Добавить("служебная_ЭтоКлючевоеСвойство");
	ТЗ.Колонки.Добавить("служебная_ЭтоЭлементКлючевогоСвойства");
	ТЗ.Колонки.Добавить("служебная_УровеньКлючевогоСвойства");
	ТЗ.Колонки.Добавить("служебная_СоставнойТип", Новый ОписаниеТипов("Булево"));
	ТЗ.Колонки.Добавить("служебная_СоставТипа");
	Возврат ТЗ;
КонецФункции

Процедура ДобавитьСведенияОСвойстве(НовСтрока, ТекСвойствоФормата, ДополнительныеПараметры, ЭтоСтрокаТЗ = Ложь)
	Если ЭтоСтрокаТЗ Тогда
		СтруктураРеквизитов = ТекСвойствоФормата;
	Иначе
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекСвойствоФормата,"СоставнойТип, Тип, Обязательное");
	КонецЕсли;
	НовСтрока.Обязательный = ?(СтруктураРеквизитов.Обязательное, "Да", "");
	// может быть null в случае с группой
	Если СтруктураРеквизитов.СоставнойТип = Истина Тогда
		НовСтрока.служебная_СоставнойТип = Истина;
		МассивТипов = ?(ЭтоСтрокаТЗ, СтруктураРеквизитов.Состав.ВыгрузитьКолонку("ТипФормата"),
						ТекСвойствоФормата.Состав.ВыгрузитьКолонку("ТипФормата"));
		НовСтрока.служебная_СоставТипа = МассивТипов;
		
		// Заполним код типа
		СтруктураКодов = Новый Структура;
		ИмяТипаЛокально = "";
		Для Каждого ИмяТипаЛокально Из МассивТипов Цикл
			КодТипаЛокально = ПолучитьКодТипа(СокрЛП(ИмяТипаЛокально), ДополнительныеПараметры);
			Если СокрЛП(КодТипаЛокально) <> "" Тогда
				СтруктураКодов.Вставить(КодТипаЛокально, СокрЛП(ИмяТипаЛокально));
			КонецЕсли;
		КонецЦикла;

		НовСтрока.служебная_КодТипа = ?(СтруктураКодов.Количество() > 0, СтруктураКодов, "");
	Иначе
		НовСтрока.ТипЗначения = ?(ЭтоСтрокаТЗ, СтруктураРеквизитов.ТипЗначения, СтруктураРеквизитов.Тип);
		НовСтрока.служебная_КодТипа = ПолучитьКодТипа(НовСтрока.ТипЗначения, ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#КонецЕсли
